package com.gyaanguru.Updates;

import android.content.Context;
import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Color;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.BaseAdapter;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;

import androidx.activity.EdgeToEdge;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.content.ContextCompat;
import androidx.core.graphics.Insets;
import androidx.core.view.ViewCompat;
import androidx.core.view.WindowInsetsCompat;

import com.gyaanguru.R;
import com.squareup.picasso.Picasso;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.Random;

public class DailyUpdatesActivity extends AppCompatActivity {

    ListView listView;
    HashMap <String, String> hashMap = new HashMap<>();
    ArrayList< HashMap<String, String> > arrayList = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        EdgeToEdge.enable(this);
        setContentView(R.layout.activity_daily_updates);
        getWindow().setStatusBarColor(ContextCompat.getColor(this, R.color.dark_blue));
        ViewCompat.setOnApplyWindowInsetsListener(findViewById(R.id.main), (v, insets) -> {
            Insets systemBars = insets.getInsets(WindowInsetsCompat.Type.systemBars());
            v.setPadding(systemBars.left, systemBars.top, systemBars.right, systemBars.bottom);
            return insets;
        });
        listView = (ListView) findViewById(R.id.dailyUpdatesListView);
        dailyUpdatesTable();
        DailyUpdatesAdapter dailyUpdatesAdapter = new DailyUpdatesAdapter();
        listView.setAdapter(dailyUpdatesAdapter);

    }

    private class DailyUpdatesAdapter extends BaseAdapter {

        @Override
        public int getCount() {
            return arrayList.size();
        }

        @Override
        public Object getItem(int i) {
            return null;
        }

        @Override
        public long getItemId(int i) {
            return 0;
        }

        @Override
        public View getView(int position, View view, ViewGroup viewGroup) {
            LayoutInflater inflater = (LayoutInflater) getSystemService(Context.LAYOUT_INFLATER_SERVICE);
            View dailyUpdatesView = inflater.inflate(R.layout.item_daily_updates, viewGroup, false);

            ImageView dailyUpdatesImage = (ImageView) dailyUpdatesView.findViewById(R.id.dailyUpdatesImage);
            TextView dailyUpdatesCategory = (TextView) dailyUpdatesView.findViewById(R.id.dailyUpdatesCategory);
            TextView dailyUpdatesTitle = (TextView) dailyUpdatesView.findViewById(R.id.dailyUpdatesTitle);
            TextView dailyUpdatesDescription = (TextView) dailyUpdatesView.findViewById(R.id.dailyUpdatesDescription);
            LinearLayout dailyUpdatesLinearLayout = (LinearLayout) dailyUpdatesView.findViewById(R.id.dailyUpdatesLinearLayout);

            HashMap<String, String> hashMap = arrayList.get(position);
            String category = hashMap.get("category");
            String title = hashMap.get("title");
            String imageURL = hashMap.get("imageURL");
            String description = hashMap.get("description");

            Picasso.get().load(imageURL).placeholder(R.drawable.baseline_image_24).into(dailyUpdatesImage);
            dailyUpdatesCategory.setText(category);
            dailyUpdatesTitle.setText(title);
            dailyUpdatesDescription.setText(description);

            Random rnd = new Random();
            int color = Color.argb(255, rnd.nextInt(256), rnd.nextInt(256), rnd.nextInt(256));
            dailyUpdatesCategory.setBackgroundColor(color);

            dailyUpdatesLinearLayout.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View view) {
                    DailyDetailsActivity.TITLE = title;
                    DailyDetailsActivity.DESCRIPTION = description;
                    Bitmap bitmap = ( (BitmapDrawable) dailyUpdatesImage.getDrawable() ).getBitmap();
                    DailyDetailsActivity.IMAGE_BITMAP = bitmap;
                    startActivity(new Intent(DailyUpdatesActivity.this, DailyDetailsActivity.class));
                }
            });

            return dailyUpdatesView;
        }
    }

    public void back(View view) {
        finish();
    }

    private void dailyUpdatesTable() {
        hashMap = new HashMap<>();
        hashMap.put("category", "LOCAL");
        hashMap.put("title", "অযথা ঘোরাঘুরি’ করা গাড়ি তল্লাশি করতে হবে: ডিএমপি কমিশনার");
        hashMap.put("imageURL", "https://cdn.bdnews24.com/bdnews24/media/bangla/imgAll/2025January/dmp-commissioner-with-oc-200125-1737392444.jpg");
        hashMap.put("description", "“মানুষের সঙ্গে যত বেশি সম্পর্ক তৈরি করবেন, তত বেশি তথ্য পাবেন। এজন্য ওসিদের থানার প্রতিটি অলিগলি ঘুরতে হবে; মানুষের সঙ্গে মিশতে হবে।”\n" +
                "এলাকার নিরাপত্তা বাড়াতে ঢাকার ওসিদের ‘অযথা ঘোরাঘুরি’ করা গাড়িতে তল্লাশি চালাতে বলেছেন ঢাকা মহানগর পুলিশের (ডিএমপি) কমিশনার শেখ মো. সাজ্জাত আলী।\n" +
                "\n" +
                "সোমবার বিকালে ঢাকার ৫০ ওসিদের সঙ্গে মতবিনিময়কালে তিনি বলেন, “অযথা যেসব মাইক্রোবাস বা প্রাইভেটকার ঘোরাঘুরি করে, সেগুলো তল্লাশি করতে হবে। ছিনতাই প্রতিরোধে বিশেষ করে ভোর বেলায় পুলিশি টহল আরও জোরদার করতে হবে। চাঁদাবাজ যেই হোক, আইনের আওতায় আনতে হবে।”\n" +
                "\n" +
                "ডিএমপি সদর দপ্তরের সম্মেলন কক্ষে এই সভা হয়। সেখানে সাজ্জাত আলী এসব নির্দেশনা দেন বলে ডিএমপির এক সংবাদ বিজ্ঞপ্তিতে বলা হয়েছে।\n" +
                "\n" +
                "তিনি বলেন, “মানুষের সঙ্গে যত বেশি সম্পর্ক তৈরি করবেন, তত বেশি তথ্য পাবেন। এজন্য ওসিদের থানার প্রতিটি অলিগলিতে ঘুরতে হবে, মানুষের সঙ্গে মিশতে হবে। তথ্য বেশি পেলে অপরাধ ঘটার আগেই ব্যবস্থা নিতে পারবেন।”\n" +
                "\n" +
                "ডিএমপি কমিশনার বলেন, “ভুক্তভোগী বা সেবাপ্রত্যাশী সবার সঙ্গে ভালো আচরণ করতে হবে। থানার অধীনে থাকা সহকর্মীদের নিয়মিত ব্রিফিং করতে হবে। মহান আল্লাহ আমাদের মানুষের নিরাপত্তার যে পবিত্র দায়িত্ব দিয়েছেন, তা সঠিকভাবে পালন করতে হবে। মানুষ যেন ন্যায়বিচার পায়, সেজন্য সঠিক পথে চলতে হবে।”\n" +
                "\n" +
                "অভিযোগ উপযুক্ত মনে হলে যথাসময়ে মামলা নিতে এবং জিডির বিষয়ে দ্রুততম সময়ে ব্যবস্থা গ্রহণের নির্দেশ দেন তিনি।\n" +
                "\n" +
                "মতবিনিময় সভায় ডিএমপি কমিশনার ওসিদের কাছ থেকে বর্তমান সময়ে থানায় পুলিশি কার্যক্রম পরিচালনার ক্ষেত্রে বিভিন্ন সমস্যা ও চ্যালেঞ্জের কথা শোনেন এবং পর্যায়ক্রমে তা সমাধানে আশ্বস্ত করেন।\n" +
                "\n" +
                "দায়িত্ব পালন ‘সাহসিকতার’ পরিচয় দেওয়ায় ভাটারা থানার এএসআই মেসবাহ উদ্দিনকে পুরস্কার দেন ডিএমপি কমিশনার। তিনি মেসবাহ উদ্দিনের সাহসিকতাকে অনুকরণীয় বলে মন্তব্য করেন।\n" +
                "\n" +
                "গত ১৫ জানুয়ারি সন্ধ্যায় ভাটারার জে-ব্লক এলাকায় ছুরিকাঘাতে আহত হয়েও ‘ছিনতাইকারী’ মোবারক হোসেন নাফিজকে গ্রেপ্তার করে এই পুরস্কার পান মেসবাহ।\n" +
                "\n" +
                "এছাড়া চলমান বিশেষ অভিযানে উত্তরা পশ্চিম থানার ওসি হাফিজুর রহমান ও মোহাম্মদপুর থানার ওসি আলী ইফতেখার হাসানকে বেশি সংখ্যক ‘ছিনতাইকারী’ গ্রেপ্তার করায় পুরস্কৃত করা হয়।\n" +
                "\n" +
                "সভায় অতিরিক্ত পুলিশ কমিশনার (ক্রাইম অ্যান্ড অপারেশনস) এস. এন. মো. নজরুল ইসলাম, যুগ্ম-পুলিশ কমিশনার (ক্রাইম) ফারুক হোসেন, যুগ্ম পুলিশ কমিশনার (ডিবি-দক্ষিণ) মোহাম্মদ নাসিরুল ইসলাম উপস্থিত ছিলেন।");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("category", "TECH");
        hashMap.put("title", "অ্যাপ ডাউনলোডের সময় বিপদ এড়াতে যেসব বিষয়ে নজর রাখবেন");
        hashMap.put("imageURL", "https://i0.wp.com/techzoom.tv/wp-content/uploads/2025/01/%E0%A6%85%E0%A7%8D%E0%A6%AF%E0%A6%BE%E0%A6%AA-%E0%A6%A1%E0%A6%BE%E0%A6%89%E0%A6%A8%E0%A6%B2%E0%A7%8B%E0%A6%A1.jpg?resize=750%2C375&ssl=1");
        hashMap.put("description", "পানির বিল থেকে শুরু করে নাটক সিনেমা দেখা সবই হচ্ছে। বিভিন্ন দরকারে একাধিক অ্যাপ ডাউনলোড করেন দিনের বিভিন্ন সময়। তবে অ্যাপ ডাউনলোড করার সময় কিছু বিষয়ে খেয়াল না রাখলে প্রতারকদের খপ্পরে পড়তে পারেন।\n" +
                "\n" +
                "জেনে নিন অ্যাপ ডাউনলোডের সময় বিপদ এড়াতে কোন বিষয়ে নজর রাখবেন-\n" +
                "\n" +
                "নির্ভরযোগ্য সোর্স থেকে ডাউনলোড\n" +
                "প্রথমেই নিশ্চিত করুন যে আপনি অ্যাপটি একটি নির্ভরযোগ্য সোর্স, যেমন-গুগল প্লে স্টোর বা অ্যাপল অ্যাপ স্টোর থেকে ডাউনলোড করছেন। এ ধরনের প্ল্যাটফর্মে বেশিরভাগ অ্যাপ প্রাথমিকভাবে পরীক্ষা করা হয়, তাই সেগুলো সুরক্ষিত হতে পারে। অনির্ভরযোগ্য সোর্স থেকে ডাউনলোড করা অ্যাপ ম্যালওয়্যার এবং ভাইরাসের ঝুঁকি বহন করতে পারে।\n" +
                "\n" +
                "অ্যাপের রেটিং এবং রিভিউ দেখুন\n" +
                "অ্যাপের রেটিং ও রিভিউ দেখে সিদ্ধান্ত নিন। উচ্চ রেটিং এবং ভালো রিভিউসমৃদ্ধ অ্যাপ সাধারণত মানসম্পন্ন ও নিরাপদ হয়। রিভিউ পড়ে ব্যবহারকারীদের অভিজ্ঞতা জানা যায় এবং কোন অ্যাপে সমস্যা বা বাগ আছে কি না তাও বোঝা যায়।\n" +
                "\n" +
                "পারমিশন যাচাই করুন\n" +
                "অ্যাপ ইনস্টল করার সময় সাধারণত ফোনের বিভিন্ন ফিচারে অ্যাক্সেস চাওয়া হয়, যেমন-ক্যামেরা, মাইক্রোফোন, কন্ট্যাক্টস ইত্যাদি। অ্যাপের কাজের সঙ্গে সামঞ্জস্যপূর্ণ পারমিশনগুলো দেওয়া ঠিক আছে, তবে অপ্রয়োজনীয় পারমিশন চাইলে সেটি সন্দেহজনক হতে পারে।\n" +
                "\n" +
                "ডাটা প্রাইভেসি নীতি পড়ুন\n" +
                "অনেক অ্যাপ আপনার ব্যক্তিগত তথ্য সংগ্রহ করতে পারে। ডাটা প্রাইভেসি নীতি পড়ে দেখুন তারা কোন ধরনের তথ্য সংগ্রহ করবে এবং কীভাবে তা ব্যবহার করবে। আপনার ব্যক্তিগত তথ্য রক্ষায় ডাটা সুরক্ষার দিকটি নিশ্চিত হওয়া জরুরি।\n" +
                "\n" +
                "অ্যাপ সাইজ এবং স্পেসিফিকেশন\n" +
                "ফোনের স্টোরেজ এবং পারফরম্যান্সের দিকে খেয়াল রেখে অ্যাপ ডাউনলোড করুন। বড় সাইজের অ্যাপ আপনার ফোনে পর্যাপ্ত স্টোরেজ না থাকলে সমস্যা সৃষ্টি করতে পারে। এ ছাড়া আপনার ফোনের অপারেটিং সিস্টেম এবং র্যামের সঙ্গে সামঞ্জস্যপূর্ণ কি না সেটিও দেখে নিন।\n" +
                "\n" +
                "ইন্টারনেট নিরাপত্তা সফটওয়্যার ব্যবহার করুন\n" +
                "অনেক সময় ডাউনলোড করা অ্যাপে ম্যালওয়্যার থাকতে পারে। এ ধরনের ঝুঁকি থেকে বাঁচতে আপনার ফোনে একটি ভালো অ্যান্টিভাইরাস বা ইন্টারনেট নিরাপত্তা সফটওয়্যার ইনস্টল করতে পারেন, যা ক্ষতিকর অ্যাপ থেকে ফোনকে রক্ষা করবে।\n" +
                "\n" +
                "আপডেট নিয়মিতভাবে চেক করুন\n" +
                "নিয়মিতভাবে অ্যাপ আপডেট চেক করুন। অনেক সময় ডেভেলপাররা সিকিউরিটি ও পারফরম্যান্স উন্নয়নে আপডেট রিলিজ করেন। নতুন আপডেটের মাধ্যমে কোনো বাগ বা নিরাপত্তা সমস্যার সমাধান হতে পারে।\n" +
                "\n" +
                "কাস্টমার সাপোর্ট এবং ফিডব্যাক দেখুন\n" +
                "বিশ্বস্ত অ্যাপগুলোর সাধারণত ভালো কাস্টমার সাপোর্ট থাকে এবং ব্যবহারকারীদের ফিডব্যাকের উপর ভিত্তি করে তারা উন্নয়ন সাধন করে। ডাউনলোডের আগে দেখে নিন অ্যাপটি ব্যবহারকারীদের অভিযোগে কতটা দ্রুত সাড়া দেয়।");
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("category", "SPORTS");
        hashMap.put("title", "9-year old Bangladeshi Mugdho beats 5-time World Champion Magnus Carlsen!");
        hashMap.put("imageURL", "https://ecdn.dhakatribune.net/contents/cache/images/1100x618x1/uploads/media/2025/01/20/Mugdho-275caa531e5c07abf8d0fd233fd919ec.jpg?jadewits_media_id=37763");
        hashMap.put("description", "Nine-year old Bangladeshi chess prodigy Rayan Rashid Mugdho bagged a surprising win over five-time World Champion Magnus Carlsen in online bullet chess on 18 January,2025, according to the player’s coach and FIDE Master Nayem Haque.\n" +
                "\n" +
                "The game was played on chess.com, one of the largest online chess platforms.\n" +
                "\n" +
                "Mugdho did not have his own account or ID to play online.\n" +
                "\n" +
                "He used the account of his coach Nayem, a Bangladeshi FIDE Master with over four years of experience coaching beginners and at intermediate level.\n" +
                "\n" +
                "Getting Carlsen as opponent and beating the former World Champion was beyond Mugdho’s expectation and it was also a rare defeat for the Norwegian as well.\n" +
                "\n" +
                "“9-year old Mugdho defeated Magnus Carlsen!” Nayem posted on facebook.\n" +
                "\n" +
                "“Mugdho wanted to play bullet battle but he can’t play without title. That’s why I gave him my ID of chess.com, he played and beat five-time World Champions and No. 1 chess player in three formats,” Nayem stated.\n" +
                "\n" +
                "What is Bullet Chess?\n" +
                "\n" +
                "According to chess.com, bullet chess is a variant of blitz chess and is faster than blitz chess.\n" +
                "\n" +
                "The rules for a bullet chess game are not different from those of a normal chess game.\n" +
                "\n" +
                "Bullet chess refers to games played with time controls that are faster than three minutes per player.\n" +
                "\n" +
                "The most popular forms of bullet chess are 1|0 (one minute with no increment per player) or 2|1 (two minutes with a one-second increment per player).\n" +
                "\n" +
                "Who plays Bullet Chess?\n" +
                "\n" +
                "From beginner to World Champion, anyone can play bullet chess.\n" +
                "\n" +
                "According to recent data, there are around 2,500,000 bullet games played per day on Chess.com (as of January 2023).\n" +
                "\n" +
                "That makes it the second most popular time control being played (behind blitz).\n" +
                "\n" +
                "How Mugdho beat Carlsen\n" +
                "\n" +
                "It was a one-minute bullet game between Mugdho and Carlsen.\n" +
                "\n" +
                "Mugdho played with white pieces.\n" +
                "\n" +
                "Carlsen made a blunder with the queen which put Mugdho up front.\n" +
                "\n" +
                "It took 50 moves before Carlson decided to resign, steering Mugdho to victory.");
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("category", "SOCIAL");
        hashMap.put("title", "বাংলাবাজারে অভিযান, উদ্ধার হলো বিনামূল্যের পাঠ্যবই");
        hashMap.put("imageURL", "https://www.kalbela.com/assets/news_photos/2025/01/20/image_157136_1737394146.webp");
        hashMap.put("description", "রাজধানীর বাংলাবাজারের বিভিন্ন দোকানে ২০২৫ শিক্ষাবর্ষের জন্য সরকারের বিনামূল্যের পাঠ্যবই বিক্রি হচ্ছিল। জাতীয় নিরাপত্তা গোয়েন্দা (এনএসআই) সংস্থার এই তথ্যের ভিত্তিতে বাংলাবাজারে বেশ কিছু লাইব্রেরিতে অভিযান চালায় এনসিটিবি।\n" +
                "\n" +
                "সোমবার (২০ জানুয়ারি) এক সংবাদ বিজ্ঞপ্তিতে এ তথ্য এনসিটিবি জানায়।\n" +
                "\n" +
                "বিজ্ঞপ্তিতে বলা হয়, সরকারিভাবে বিনামূল্যে বিতরণযোগ্য পাঠ্যপুস্তক কোতয়ালী থানাধীন বাংলাবাজার বই মার্কেটের বিভিন্ন দোকানে বিক্রি হচ্ছে এমন সুনির্দিষ্ট তথ্য এনএসআইয়ের পক্ষ থেকে শিক্ষা মন্ত্রণালয়কে দেওয়া হয়।\n" +
                "\n" +
                "পরবর্তীতে ওই তথ্যের ভিত্তিতে এনএসআই ও এনসিটিবি’র প্রতিনিধি দলের উপস্থিতিতে নির্বাহী ম্যাজিস্ট্রেট অভিযান পরিচালনা করে বই বাজার বিডি এবং জাহিদ বুক হাউজ নামে দুটি দোকানের প্রত্যেকটিকে এক হাজার টাকা করে জরিমানা করেন এবং পাঁচ হাজার বই জব্দ করেন।" +
                "এতে আরও বলা হয়, অভিযান চলাকালে বাংলাবাজার বই মার্কেটের ২টি দোকান ও ১টি গোডাউনে সরকার প্রিন্টার্স, লেটার এন্ড কালার লি., সীমান্ত প্রেস এন্ড পাবলিকেশন, মাস্টার সিমেক্স ও সুবর্ণা প্রিন্টিং প্রেসে মুদ্রণকৃত মাধ্যমিকের বিভিন্ন শ্রেণীর বাংলা, ইংরেজি ও গণিতের প্রায় পাঁচ হাজার বই জব্দ করা হয়। এছাড়াও ভবিষ্যতে এই ধরনের অপরাধ করলে সর্বোচ্চ জরিমানা ও জেল প্রদান করা হবে বলেও সতর্ক করা হয়।\n" +
                "\n" +
                "উল্লেখ্য, এনসিটিবির পাঠ্যপুস্তকের মান নিয়ন্ত্রণ, কাগজ ও আর্ট কার্ডের মজুদ, গাইড বই মুদ্রণ ও সরকারি বই বাজারে বিক্রির বিরুদ্ধে এনএসআই নিয়মিত অভিযান পরিচালনা করছে।");
        arrayList.add(hashMap);




        hashMap = new HashMap<>();
        hashMap.put("category", "RELIGION");
        hashMap.put("title", "নামাজের মধ্যে হাঁচি কি দিলে ‘আলহামদুলিল্লাহ’ বলা যাবে?");
        hashMap.put("imageURL", "https://humanappeal.org.uk/media/jijlq3ye/24why-we-pray-salah.jpg");
        hashMap.put("description", "নামাজের বাইরে সাধারণ অবস্থায় হাঁচি দেওয়ার পর আলহামদুলিল্লাহ বলা মুস্তাহাব। হাদিসে হাঁচি দেওয়ার পর আলহামদুলিল্লাহ পড়া এবং তার জবাব দেওয়ার নির্দেশনা এসেছে। আবু হোরায়রা (রা.) থেকে বর্ণিত আল্লাহর রাসুল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন,\n" +
                "\n" +
                "إِذَا عَطسَ أحَدُكُمْ فَلْيَقُلْ: الحَمْدُ للهِ، وَلْيَقُلْ لَهُ أخُوهُ أَوْ صَاحِبُهُ: يَرْحَمُكَ الله، فإذَا قَالَ لَهُ: يَرْحَمُكَ اللهُ، فَلْيَقُلْ: يَهْدِيكُمُ اللهُ وَيُصْلِحُ بالَكم তোমাদের কেউ যখন হাঁচি দেয় তখন সে যেন আলহামদুলিল্লাহ (অর্থ: সব প্রশংসা আল্লাহর) বলে। এবং তার সাথে থাকা ব্যক্তি যেন উত্তরে ইয়ারহামুকাল্লাহ (অর্থ: আল্লাহ আপনার ওপর দয়া করুন) বলে। যখন তার সাথে থাকা ব্যক্তি ইয়ারহামুকাল্লাহ বলবে তখন হাঁচিদাতা উত্তরে বলবে য়াহদিকুমুল্লাহু ওয়া ইউসলিহু বালাকুম । (সহিহ বুখারি: ৬২২৪)\n" +
                "\n" +
                "নবিজির (সা.) এই নির্দেশ নামাজের বাইরে সাধারণ অবস্থার ক্ষেত্রে প্রযোজ্য। নামাজ আদায়ের সময় হাঁচি দিলে আলহামদুলিল্লাহ বলার নিয়ম নেই। নামাজ পড়ার সময় নিজে হাঁচি দিয়ে আলহামদুলিল্লাহ বললে নামাজ ভেঙে যাবে না। তবে ইচ্ছাকৃত এমনটি করা ঠিক নয়।\n" +
                "\n" +
                "নামাজ আদায়ের অন্যের হাঁচির জবাবে ইয়ারহামুকাল্লাহ বললে নামাজ ভেঙে যাবে। নামাজ অবস্থায় কারো সাথে কথা বলা বা কাউকে সালাম দেওয়াও নিষিদ্ধ। রাসুল (সা.) বলেছেন,\n" +
                "\n" +
                "إِنّ هَذِهِ الصّلَاةَ لَا يَصْلُحُ فِيهَا شَيْءٌ مِنْ كَلَامِ النّاسِ، إِنَّمَا هُوَ التّسْبِيحُ وَالتّكْبِيرُ وَقِرَاءَةُ الْقُرْآنِ. নামাজে কারো সাথে কথা বলার সুযোগ নেই। নামাজ শুধু তাসবিহ, তাকবি ও কুরআন তিলাওয়াত। (সহিহ মুসলিম: ৫৩৭)\n" +
                "\n" +
                "তাই নামাজ অবস্থায় ইচ্ছাকৃতভাবে বা ভুল করে কাউকে সম্বোধন করে কিছু বললে বা সালাম দিলে নামাজ ভেঙে যাবে। শুধু নিজে শুনতে পায় এতটুকু নিচু আওয়াজে কথা বলে ফেললেও নামাজ ভেঙে যাবে।কেউ যদি নামাজ আদায়রত ব্যক্তিকে সালাম দেয়, নামাজি ইচ্ছাকৃতভাবে বা ভুল করে সশব্দে অর্থাৎ মুখে উচ্চারণ করে সালামের উত্তর দেয়, তাহলে নামাজ ভেঙে যাবে।");
        arrayList.add(hashMap);




        hashMap = new HashMap<>();
        hashMap.put("category", "INTERNATIONAL");
        hashMap.put("title", "গাজার ধ্বংসস্তূপ থেকে একের পর এক উদ্ধার হচ্ছে মরদেহ");
        hashMap.put("imageURL", "https://cdn.ittefaqbd.com/contents/cache/images/1100x618x1/uploads/media/2025/01/20/90c90fe3de9308eadc84e680a9385e16-678e545dc532e.jpg?jadewits_media_id=206742");
        hashMap.put("description", "যুদ্ধবিরতির পর গাজার ধ্বংসস্তূপ থেকে একের পর এক উদ্ধার করা হচ্ছে মরদেহ। শুধু রাফাহ শহরের ধ্বংসস্তূপ থেকেই ৯৭ ফিলিস্তিনির মরদেহ উদ্ধার করা হয়েছে। মরদেহগুলো গাজার ইউরোপীয় হাসপাতালে স্থানান্তর করা হয়েছে।\n" +
                "দীর্ঘ ১৫ মাস যুদ্ধের পর অনেক ফিলিস্তিনি এরই মধ্যে বাড়িতে ফিরতে শুরু করেছেন। এ নিয়ে অনেকে উল্লাস করছেন। তবে অনেকের মধ্যেই বিষাদের সুর। কেননা তাদের স্বজন কিংবা সাজানো বাড়ি আর বাড়ি নেই, ধ্বংসস্তুপে পরিণত হয়েছে সব সম্পদ।\n" +
                "\n" +
                "গাজায় ইসরায়েলের যুদ্ধে ২০২৩ সালের ৭ অক্টোবর থেকে এ পর্যন্ত অন্তত ৪৬ হাজার ৯১৩ জন ফিলিস্তিনি নিহত ও ১ লাখ ১০ হাজার ৭৫০ জন আহত হয়েছে। ধ্বংস্তূপের নিচে অনেক মরদেহ থাকতে পারে বলে ধারণা করে হচ্ছে।\n" +
                "জাতিসংঘের এক রিপোর্টে বলা হয়েছে, গাজার ৯২ শতাংশ বাড়ি পুরোপুরি ধ্বংস হয়েছে বা ক্ষতিগ্রস্ত হয়েছে। চার লাখ ১৬ হাজার বাড়ি ক্ষতিগ্রস্ত হয়েছে। এর মধ্যে এক লাখ ৬০ হাজার বাড়ি পুরোপুরি ধ্বংস এবং দুই লাখ ৭৬ হাজার বাড়ি ব্যাপকভাবে বা আংশিক ক্ষতিগ্রস্ত হয়েছে।");
        arrayList.add(hashMap);


        hashMap = new HashMap<>();
        hashMap.put("category", "AGRICULTURE");
        hashMap.put("title", "দুই কারণে কৃষিতে আগ্রহ হারাচ্ছেন কৃষকরা: সিলেটে কর্মশালায় বক্তারা");
        hashMap.put("imageURL", "https://www.bssnews.net/bangla/assets/news_photos/2025/01/02/image-169747-1735755000.jpg");
        hashMap.put("description", "সিলেটে কৃষি বিষয়ক কর্মশালায় বক্তারা বলেছেন, ‘শ্রমিক সংকট ও উৎপাদন খরচ বেড়ে যাওয়ায় কৃষি কাজ করে বাংলাদেশে আর্থিকভাবে ক্ষতিগ্রস্ত হয়ে থাকেন কৃষকরা। এ কারণে তারা কৃষিতে আগ্রহ হারাচ্ছেন। তাই, কৃষকদের রক্ষায় প্রযুক্তিভিত্তিক কৃষিতে মনোনিবেশ করতে হবে।’\n" +
                "\n" +
                "আজ বুধবার সিলেটে সমন্বিত ব্যবস্থাপনার মাধ্যমে কৃষি যান্ত্রিকীকরণ প্রকল্পের আওতায় আঞ্চলিক কর্মশালায় বক্তারা এসব কথা বলেন। \n" +
                "\n" +
                "সিলেটের মৃত্তিকা সম্পদ উন্নয়ন ইনস্টিটিটে দিনব্যাপী এই কর্মশালার আয়োজন করে কৃষি সম্প্রসারণ অধিদপ্তর (ডিএই) সিলেট অঞ্চল।\n" +
                "\n" +
                "কর্মশালায় বক্তারা আরও বলেন, ‘বাংলাদেশে বর্তমানে কৃষি শ্রমিকের সংকট বেড়েই চলছে। এর অন্যতম কারণ, বিদেশমুখী যুবসমাজ। তারা কাজের সন্ধানে ইউরোপ, আমেরিকা ও মধ্যপ্রাচ্যে পাড়ি জমাচ্ছেন।’\n" +
                "\n" +
                "তারা বলেন, ‘শ্রমিক সংকটের পাশাপাশি কৃষি উৎপাদন খরচও অধিক হারে বৃদ্ধি পেয়েছে। উৎপাদন খরচ বেড়ে যাওয়ায় কৃষকরা কৃষি কাজ করে আর্থিকভাবে ক্ষতিগ্রস্ত হচ্ছেন। এতে কৃষিতে আগ্রহ হারাচ্ছেন কৃষকরা।’\n" +
                "\n" +
                "উৎপাদন কমে গেলে বাংলাদেশে বিশাল জনগোষ্টির খাদ্য ও পুষ্টি নিরাপত্তা ব্যাহত হবে জানিয়ে বক্তারা কৃষিতে আগ্রহী করতে কম খরচে ও কম পরিশ্রমে বেশি উৎপাদনের জন্য প্রযুক্তিনির্ভর কৃষিতে মনোনিবেশের আহ্বান জানান। \n" +
                "\n" +
                "তারা বলেন, ‘কৃষি যান্ত্রিকীকরণ সময়োপযোগী একটি পদ্ধতি। এর ফলে সময় এবং আর্থিক ব্যয় অনেকাংশে কমানো সম্ভব। সরকার কৃষি যন্ত্র ক্রয়ের ক্ষেত্রে কৃষকদের জন্য বিশেষ ভর্তুকির ব্যবস্থা রেখেছে।’ \n" +
                "\n" +
                "ডিএই, সিলেট অঞ্চলের অতিরিক্ত পরিচালক কৃষিবিদ ড.মোহাম্মদ কাজী মজিবুর রহমানের সভাপতিত্বে কর্মশালায় প্রধান অতিথির বক্তব্য দেন ডিএই খামার বাড়ী ঢাকার সরেজমিন উইং-এর পরিচালক কৃষিবিদ সরকার শফি উদ্দিন আহমদ।\n" +
                "\n" +
                "বিশেষ অতিথির বক্তব্য দেন ডিএই সিলেট-এর উপপরিচালক কৃষিবিদ মোহাম্মদ খয়ের উদ্দিন মোল্লা, ডিএই সুনামগঞ্জের উপপরিচালক বিমল চন্দ্র সোম, আঞ্চলিক বীজ প্রত্যয়ন অফিসার জালাল উদ্দিন সরকার, বারি, আকবরপুর, মৌলভীবাজারের মূখ্য বৈজ্ঞানিক কর্মকর্তা ড. মাহমুদুল ইসলাম নজরুল।\n" +
                "\n" +
                "কর্মশালায় উপস্থিত ছিলেন, ডিএই সিলেট অঞ্চলের কৃষি মন্ত্রনালয়ের আওতাধীন বিভিন্ন দপ্তরের কর্মকর্তা, কৃষি যন্ত্রপাতি সরবরাহকারী প্রতিষ্ঠানের প্রতিনিধি, স্থানীয় কৃষি যন্ত্রপাতি প্রস্তুতকারী প্রতিষ্ঠান প্রতিনিধি ও যন্ত্র ব্যবহারকারী কৃষকরা।\n" +
                "\n" +
                "গোলাপগঞ্জ উপজেলা কৃষি অফিসার মাশরেফুল আলমের পরিচালনায় কর্মশালার শুরুতে পবিত্র কুরআন তেলাওয়াত করেন কৃষি অফিসার তৌফিক হোসেন খান, গীতা পাঠ করেন মনোরঞ্জন অধিকারী, উপজেলা কৃষি অফিসার, দিরাই। স্বাগত বক্তব্য দেন, প্রকল্পের উপপ্রকল্প পরিচালক শফিকুল আলম।");
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("category", "KNOWLEDGE");
        hashMap.put("title", "কম্পিউটার ভালো ও নতুনের মতো রাখার উপায়!");
        hashMap.put("imageURL", "https://quizizz.com/_media/quizzes/e726be8c-25f9-40ae-a93d-91652e68f7ac_200_200");
        hashMap.put("description", "কম্পিউটার সুরক্ষায় আমরা অনেক কিছুই অবলম্বন করি। কিন্তু সঠিক উপায় কজন জানেন? সাধারণত ছোটো কোনো কারণে কম্পিউটারে নানা সমস্যা দেখা যায়। সেগুলো না বুঝে নিজের মতো করে যত্ন করাও বিপদের কারণ হতে পারে। কম্পিউটারের সুরক্ষায় নিচের কাজগুলো করা যেতে পারে।\n" +
                "\n" +
                "উপযুক্ত স্থান নির্বাচন করা\n" +
                "কম্পিউটারটিকে ধুলোবালি মুক্ত এমন কোনো পরিষ্কার এবং পরিচ্ছন্ন স্থানে রাখুন, যেখানে পর্যাপ্ত আলো-বাতাসের ব্যবস্থা আছে। স্যাঁতসেঁতে পরিবেশ এবং সরাসরি সূর্যের আলো ও তাপ প্রবেশ করে এমন স্থান থেকে কম্পিউটারকে দূরে রাখুন। কম্পিউটারের তার, সুইচ ও অন্যান্য বৈদ্যুতিক যন্ত্রাংশ যথাসম্ভব শিশু ও গৃহপালিত পশু-পাখির নাগালের বাইরে রাখুন।\n\n" +
                "\nতাপমাত্রা ঠিক রাখা\n" +
                "সাধারণত আমরা খেয়াল করি না কম্পিউটারের ভেতরে কী চলছে। দুয়েক বছরের পুরোনো কম্পিউটারের প্রসেসরের ওপর যে কুলার থাকে সেটিতে ধুলো জমে কুলিংয়ের কাজে ব্যাঘাত ঘটে। তা ছাড়া ফ্যানের নিচে আর প্রসেসরের মাঝে যে থার্মাল পেস্টের লেয়ার থাকে সেটি শুকিয়ে গেলে সিপিইউ থেকে তাপ কুলার পর্যন্ত পৌঁছতে পারে না। এখন থেকে কম্পিউটার চালিয়ে এইচডব্লিউ মনিটর (HW Monitor) নামের সফটওয়্যার ব্যবহার করুন। মাঝে মাঝে খেয়াল করে দেখুন— কম্পিউটার যখন চালু করছেন, আর যখন খুব কাজ করছেন, সর্বোচ্চ তাপমাত্রা কত। যদি দেখেন সাধারণ ভাবে ৩৫-৪০ ডিগ্রি সেলসিয়াস এবং সর্বোচ্চ ৭৫ ডিগ্রির মধ্যে ঘোরাফেরা করছে, খুব একটা চিন্তার কারণ নেই। তাপমাত্রা যদি তার থেকে বেড়ে যায়, ভালো করে ভেতরের ধুলো পরিষ্কার করুন। অনেক ক্ষেত্রে এতেই কাজ হয়ে যায়। কিন্তু তাতেও না হলে থার্মাল পেস্ট পাল্টাতে হতে পারে।\n" +
                "\n" +
                "অপ্রয়োজনীয় ফাইল, অ্যানিমেশন ও ভিজ্যুয়াল এফেক্ট দূর করা\n\n" +
                "কম্পিউটারে জমা হওয়া অপ্রয়োজনীয় ফাইল, আকর্ষণীয় অ্যানিমেশন ইত্যাদি কাজের গতি কমিয়ে দেয়। উক্ত গতি ঠিক করতে পারে ক্লিনআপ প্রোগ্রাম। সেক্ষেত্রে যেকোনো ক্লিনার অ্যাপ ব্যবহার করা যেতে পারে। পাশাপাশি, অপ্রয়োজনীয় সফটওয়্যারগুলো আনইন্সটল করে দিন। প্রয়োজনবোধে অপারেটিং সিস্টেম রিইনস্টল করুন।\n" +
                "\n" +
                "\nছবি না জমানো\n" +
                "বর্তমানে মোবাইল ফোন এবং ডিজিটাল ক্যামেরার কল্যাণে এখন অনেক অনেক ছবি তোলা যায়, সাথে সেলফি তো আছে বটেই। কিন্তু এসকল ছবি রাখার পর্যাপ্ত জায়গা কোথায়? একটি ভালো মানের স্মার্টফোনের ক্যামেরায় ছবি তুললে সেই ছবি এখন কমপক্ষে ২ থেকে ৫ মেগাবাইট জায়গা দখল করে নেয়। আপনি যদি সবগুলো পিকচার আপনার ল্যাপটপ, কম্পিউটার বা ডেস্কটপে রেখে দিতে চান তাহলে সেটি জায়গা দখল করে নেবেই। আপনি ল্যাপটপ, ডেক্সটপের জায়গা যত বেশি পরিমাণ ভর্তি করে রাখবেন, তত আপনার কাজ করতে অসুবিধা সৃষ্টি হবে। তাই ছবিগুলো বেছে বেছে ল্যাপটপের মধ্যে রাখুন। আর এখন ছবি ডিভাইসে না রেখে অনলাইনে রাখার মতো পর্যাপ্ত ড্রাইভ রয়েছে, যেমন— গুগল ড্রাইভ, গুগল ফটোস ইত্যাদি। আপনি এগুলোতে একটি অ্যাকাউন্ট খুলে নিয়ে ফ্রিতে ১৫ জিবি ব্যবহার করতে পারবেন।\n" +
                "\n" +
                "\nআপডেটেড অ্যান্টিভাইরাস ব্যবহার করা\n" +
                "কম্পিউটারে অ্যান্টিভাইরাসের সর্বাধুনিক ভার্সন ব্যবহার করুন ও নিয়মিত আপডেট করুন। এরপর নিয়মিত ভাইরাস চেকিং, স্ক্যানিং চালু রাখুন। অন্যথায় ভাইরাসের কারণে কম্পিউটারের গতি কমে যেতে পারে।\n\n" +
                "স্টার্টআপ সফটওয়্যার কমানো\n" +
                "কম্পিউটার স্টার্ট করার সময় যেসব সফটওয়্যার চালু হয় সেগুলো লক্ষ্য করুন। এখানে বেশি সফটওয়্যার থাকলে তা কম্পিউটারের গতি কমিয়ে দেবে। এজন্য স্টার্ট মেনু থেকে “Msconfig” টাইপ করুন। এরপর “Startup”-এ যান। এখানেই কম্পিউটার চালুর সময়কার সফটওয়্যারগুলো পাবেন। তবে এখান থেকে যেকোনো কিছু ডিলিট করার আগে ভালোভাবে জেনে নিন। অন্যথায় তা কম্পিউটারের সমস্যা তৈরি করতে পারে।\n" +
                "\n" +
                "ক্লিন উইন্ডোজ ইনস্টল করা\n" +
                "কম্পিউটারে যদি অসংখ্য সফটওয়্যার ও ভাইরাসের ছড়াছড়ি থাকে তাহলে তার সব সফটওয়্যার নতুন করে ইনস্টল করাই ভালো। এজন্য উইন্ডোজ ইনস্টলের সিডি বা ইউএসবি স্টিক সংগ্রহ করুন। এরপর নির্দেশনা অনুযায়ী ইনস্টল করুন। সম্ভব হলে হার্ড ডিস্ক পার্টিশন “সি” (অথবা আপনি যেখানে উইন্ডোজ রাখতে চান) সম্পূর্ণ ফরম্যাট করে নতুন করে সেখানে উইন্ডোজ ইনস্টল করুন।\n" +
                "\n" +
                "ব্রাউজারের ক্যাশ পরিষ্কার করা\n" +
                "আপনার ইন্টারনেট ব্রাউজারে যদি নিয়মিত ওয়েবসাইট ভিজিট করেন, তাহলে এর ক্যাশে বহু ফাইল জমা হতে পারে। এ ফাইলগুলো দূর করার জন্য সেটিংস মেনু থেকে ক্যাশ অপশনে যান। এরপর ক্লিয়ার ক্যাশ ক্লিক করুন।\n" +
                "\n" +
                "সার্চ ইনডেস্ক রিফ্রেশ করা\n" +
                "কম্পিউটারে সংরক্ষিত বিভিন্ন ফাইল দ্রুত সময়ে খুঁজে বের করতে সার্চ ইনডেস্ক রিফ্রেশ করা প্রয়োজন। এজন্য উইন্ডোজের ডিস্ক ডিফ্র্যাগমেন্টার নিয়মিত (সাধারণ ব্যবহারে সপ্তাহে একবার) চালাতে হবে। এটি সাধারণত কন্ট্রোল প্যানেলেই সহজে খুঁজে পাওয়া যায়।\n" +
                "\n" +
                "কম্পিউটার রিস্টার্ট করা\n" +
                "কম্পিউটার যদি দীর্ঘক্ষণ একনাগাড়ে চলে তাহলে গতি কমে যেতে পারে। এক্ষেত্রে সমাধান হলো রিস্টার্ট করা। তবে বিনা দরকারে যখন তখন কম্পিউটার রিস্টার্ট করা বা সরাসরি মেইন সুইচ অফ করা থেকে বিরত থাকুন। যেকোন যান্ত্রিক ত্রুটি দেখা দিলে প্রথমে ম্যানুয়ালি শাট ডাউন করুন ও প্রয়োজনবোধে প্রধান বৈদ্যুতিক সংযোগ বিচ্ছিন্ন করুন।\n" +
                "\n" +
                "কম্পিউটার নিয়মিত সার্ভিসিং করানো\n" +
                "বছরে অন্তত একবার হলেও কম্পিউটার সার্ভিসিং করুন। সার্ভিসিং করানোটা আপনার অযথা বলে মনে হতে পারে কিন্তু আপনি যদি এটি করেন তাহলে লক্ষ্যে করে দেখবেন আপনার ল্যাপটপ, ডেক্সটপের আয়ু বাড়বে। ডিভাইস নষ্ট হওয়ার পর ঠিক করানোর তুলনায় আগে থেকে যত্ন নেওয়াটা অনেক বেশি কার্যকর। আর সবসময় চেষ্টা করবেন বিশ্বস্ত ব্যক্তি বা পরিচিত কোনো ব্যক্তি বা প্রতিষ্ঠানের সেবা নিতে এবং এক জায়গা থেকেই নিয়মিত সার্ভিসিং করাবেন। এতে করে আপনার ডিভাইস সঠিকভাবে সার্ভিসিং করার নিশ্চয়তা রয়ে যায়।");
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("category", "CAREER");
        hashMap.put("title", "যে পাঁচটি পেশার চাহিদা বাড়ছে, সফল হতে যে সব দক্ষতার প্রয়োজন");
        hashMap.put("imageURL", "https://ichef.bbci.co.uk/ace/ws/800/cpsprodpb/9d9b/live/51c79050-6d02-11ef-b43e-6916dcba5cbf.jpg.webp");
        hashMap.put("description", "বিগ ডেটা, ক্লাউড কম্পিউটিং এবং কৃত্রিম বুদ্ধিমত্তা শ্রমবাজারে আমূল পরিবর্তন আনবে।\n" +
                "বিশ্বে চাকরির বাজার আগের চেয়ে অনেক দ্রুত বদলে যাচ্ছে এবং এখনকার অনেক চাকরির অস্তিত্ত্ব শিগগিরই অদৃশ্য হয়ে যাবে।\n" +
                "\n" +
                "এই পরিবর্তনের পেছনে প্রধান দুটি কারণের কথা ওয়ার্ল্ড ইকোনমিক ফোরামের সাম্প্রতিক সমীক্ষায় উঠে এসেছে।\n" +
                "\n" +
                "কারণ দুটি হল নতুন প্রযুক্তির উত্থান বা অটোমেশন এবং সবুজ ও টেঁকসই অর্থনীতির দিকে এগিয়ে যাওয়া।\n" +
                "\n" +
                "বিগ ডেটা, ক্লাউড কম্পিউটিং এবং কৃত্রিম বুদ্ধিমত্তার মতো নতুন নতুন প্রযুক্তির দ্রুত অগ্রগতি শ্রমবাজারে আমূল পরিবর্তন আনবে বলে ধারণা করা হচ্ছে।\n" +
                "\n" +
                "ভাল খবর হল, নতুন প্রযুক্তি সার্বিক অর্থনৈতিক উন্নয়নে সাহায্য করবে। এতে একদিকে যেমন অনেক কর্মসংস্থানের খাত তৈরি হবে তেমন অনেক কর্মসংস্থান ধ্বংসও হয়ে যাবে।\n" +
                "\n" +
                "সর্বোপরি, যখন একটি প্রতিষ্ঠান অল্প কর্মসংস্থানে বেশি অর্জন করতে পারে, তখন সেটা স্বাভাবিকভাবেই বেশি প্রসারিত হয়।\n" +
                "\n" +
                "ওয়ার্ল্ড ইকোনমিক ফোরামের গবেষকরা বলছেন, আগামী পাঁচ বছরে বর্তমান চাকরির বাজার প্রায় এক-চতুর্থাংশ বদলে যাবে।\n" +
                "\n" +
                "সুতরাং একটি ক্রমবর্ধমান প্রতিযোগিতামূলক চাকরির বাজারে সফল হতে প্রতিনিয়ত নতুন দক্ষতা শিখে সক্ষমতা বাড়ানোর কোনও বিকল্প নেই।\n" +
                "প্রধান দক্ষতা\n" +
                "কারিগরি জ্ঞান হল এমন এক প্রধান দক্ষতা যা নতুন চাকরির প্রতিযোগিতামূলক বাজারে টিঁকে থাকার জন্য অবশ্যই অর্জন করতে হবে।\n" +
                "\n" +
                "এর অর্থ এই নয় যে প্রত্যেকেরই প্রোগ্রামিং ভাষা জানতে হবে বা মেশিন লার্নিং এর আদ্যোপান্ত সব বুঝতে হবে।\n" +
                "\n" +
                "কিন্তু ভবিষ্যতে 'স্টেম' চাকরির চাহিদা আরও বেশি হবে বলে আশা করা হচ্ছে।\n" +
                "\n" +
                "ইংরেজি বর্ণমালার চারটি অক্ষর এস, টি, ই, এম - অর্থাৎ ‘স্টেম’ এর পূর্ণ অর্থ হল সায়েন্স বা বিজ্ঞান, টেকনোলজি বা প্রযুক্তি, ইঞ্জিনিয়ারিং বা প্রকৌশল এবং ম্যাথম্যাটিকস বা গণিত।\n" +
                "\n" +
                "স্টেম শব্দটি মূলত এই চারটি স্বতন্ত্র কিন্তু একে অপরের সাথে প্রযুক্তিগতভাবে সম্পর্কিত শাখাগুলোকে একত্রে বোঝাতে ব্যবহৃত হয়।\n" +
                "\n" +
                "সুতরাং আপনি যদি ভাবেন আপনার সন্তানের স্কুলে কোন বিষয়গুলোয় ফোকাস করা উচিত, তাহলে এর উত্তর হবে: গণিত, কম্পিউটার সায়েন্স, এবং ন্যাচারাল সায়েন্সেস।\n" +
                "\n" +
                "ন্যাচারাল সায়েন্সেসের আওতায় পদার্থবিজ্ঞান, রসায়ন, জীববিজ্ঞান, জৈব রসায়ন, সমুদ্র বিজ্ঞান, জ্যোতির্বিদ্যা, ভূগোল, ভূ-বিজ্ঞান এই সব বিষয়গুলো অন্তর্ভুক্ত হবে।\n" +
                "\n" +
                "এক কথায় ভৌত জগতের সাথে সম্পর্কিত বিজ্ঞানের শাখাই হল ন্যাচারাল সায়েন্সেস।\n\n" +
                "এরপর যে বিষয়ে দক্ষতা অর্জনে মনোযোগ দিতে হবে তা হল অ্যানালিটিকাল থিংকিং বা বিশ্লেষণধর্মী চিন্তাভাবনা।\n" +
                "\n" +
                "বিশ্লেষণধর্মী চিন্তাভাবনা বিকাশের জন্য, আপনাকে আপনার জ্ঞানার্জনের ক্ষমতাকে ঘষেমেজে উন্নত করতে হবে।\n" +
                "\n" +
                "যেন আপনার মন এবং মনন একটি বিষয়ের ভিন্ন ভিন্ন প্যাটার্ন বা বিভিন্ন ব্যাখ্যা লক্ষ্য করতে পারে।\n" +
                "\n" +
                "বিভিন্ন ঘটনা বা বিষয়বস্তু একটার সাথে আরেকটির সংযোগ স্থাপন করতে পারে এবং এমন এক সিদ্ধান্তে উপনীত হতে পারে যেখানে আবেগ বা ব্যক্তিগত পছন্দের কোনও প্রভাব নেই।\n" +
                "\n" +
                "এভাবে নিজের জ্ঞান আহরণের ক্ষমতাকে আরও শাণিত করতে হবে।\n" +
                "\n" +
                "এই সক্ষমতা অর্জনের জন্য কোনও একটি বিষয়ে মনোযোগ এবং একাগ্রতা ধরে রাখার অভ্যাস গড়ে তুলতে হবে। এজন্য মনকে প্রশিক্ষিত করা প্রয়োজন।\n" +
                "\n" +
                "কারণ আজকাল বিভিন্ন গ্যাজেট, সামাজিক যোগাযোগ মাধ্যম, অনলাইন গেম এবং বিজ্ঞাপনের কারণে আমাদের মনোযোগ ধরে রাখাই বড় চ্যালেঞ্জ হয়ে দাঁড়িয়েছে।\n" +
                "\n" +
                "কেন না এসব বিষয়ে সংযুক্ত না থাকলে আমাদের মধ্যে হারিয়ে যাওয়ার ভয় সৃষ্টি হয়। যাকে অনেকে বলেন 'ফিয়ার অফ মিসিং আউট'।\n" +
                "\n" +
                "অ্যানালিটিকাল স্কিলস বা বিশ্লেষণধর্মী দক্ষতার মধ্যে রয়েছে কৌতূহল এবং প্রতিনিয়ত নিজেকে স্ব-শিক্ষিত করে তোলার বিষয়টি।\n" +
                "\n" +
                "এভাবে ক্রমাগত নিজেকে উন্নত করতে এবং শিখতে, আপনাকে একটি নির্দিষ্ট লক্ষ্যের দিকে ফোকাস ধরে রাখা আয়ত্ত করতে হবে।\n\n" +
                "উচ্চ স্তরের ইংরেজি ভাষা শেখাও অত্যন্ত মূল্যবান একটি দক্ষতা।\n" +
                "\n" +
                "এছাড়া সৃজনশীলতাও বেশ জরুরি। বিজ্ঞান, প্রকৌশল, নকশা বা শিল্পে, যে ব্যক্তি প্রযুক্তিগত দক্ষতার সাথে সৃজনশীলতাকে এক করতে পারবেন তারই পদোন্নতি পাওয়ার সুযোগ বেশি।\n" +
                "\n" +
                "কৃত্রিম বুদ্ধিমত্তার এই যুগে যোগাযোগ এবং সহানুভূতি অত্যন্ত মূল্যবান দুটি দক্ষতা।\n" +
                "\n" +
                "যন্ত্র যত দ্রুত বিকাশ লাভ করুক না কেন, মানুষের সব সময়েই আরেকজন মানুষের প্রয়োজন হবে এবং মানুষের প্রতি মানুষের মনোযোগ, সবাই মিলে কাজ করা, একজন আরেকজনের কথা মনোযোগ দিয়ে শোনা, গল্প করা, পাশে থাকা এবং সহানুভূতির মূল্য দিন দিন বাড়তেই থাকবে।\n" +
                "\n" +
                "২০২০ সালে প্রকাশিত লিঙ্কড-ইনের একটি প্রতিবেদন অনুসারে, যোগাযোগ ইতিমধ্যেই আজকের চাকরির বাজারে সবচেয়ে চাহিদাসম্পন্ন দক্ষতা হয়ে উঠেছে।\n" +
                "\n" +
                "“কর্মক্ষেত্রে কৃত্রিম বুদ্ধিমত্তা (এআই) এবং রোবটিক্সের ব্যবহার, রিমোট ওয়ার্কফোর্স বা দূরবর্তী চাকরিজীবীদের হার বেড়ে যাওয়া এবং প্রযুক্তির ক্রমবিকাশ হওয়ার সাথে সাথে আমরা সারা বিশ্বের মানুষের সাথে সংযোগ স্থাপন করতে পারছি।\"\n" +
                "\n" +
                "\"এতো মানুষের সাথে কথা বলতে বা তাদের কথা শুনতে জানা এবং তাদের সাথে সংযোগ তৈরি করার চেয়ে কখনই কোনও কিছু গুরুত্বপূর্ণ ছিল না”, বলেছেন প্রতিভা এবং কর্মক্ষেত্রে সংযোগ স্থাপন বিশেষজ্ঞ ড্যান নেগ্রোনি।\n\n" +
                "নতুন প্রযুক্তি অদূর ভবিষ্যতের জন্য সবচেয়ে প্রতিশ্রুতিশীল খাতগুলির মধ্যে একটি।\n" +
                "১. নতুন প্রযুক্তি\n" +
                "এতে অবাক হওয়ার কিছু নেই যে তথ্য প্রযুক্তি এবং নতুন প্রযুক্তি অদূর ভবিষ্যতে সব চেয়ে প্রতিশ্রুতিশীল খাতগুলির মধ্যে একটি।\n" +
                "\n" +
                "কৃত্রিম বুদ্ধিমত্তা বিকাশের পাশাপাশি মেশিন লার্নিং-দক্ষতা অনেক আকর্ষণীয় সব সুযোগ তৈরি করবে।\n" +
                "\n" +
                "এক্ষেত্রে সবচেয়ে প্রতিশ্রুতিশীল পেশাগুলোর মধ্যে একটি হল প্রম্পট ইঞ্জিনিয়ারিং। এরা মূলত যোগাযোগ বিশেষজ্ঞ যারা কৃত্রিম বুদ্ধিমত্তার মডেলগুলোর সাহায্যে এই যোগাযোগের কাজটি করে থাকে।\n" +
                "\n" +
                "তারা সঠিকভাবে গ্রাহকদের অনুরোধগুলো সঠিকভাবে প্রণয়ন করতে সাহায্য করে এবং কৃত্রিম বুদ্ধিমত্তা এবং মানুষের মধ্যে এক ধরনের মধ্যস্থতাকারী হিসাবে কাজ করে৷\n" +
                "\n" +
                "এআই সম্পর্কিত অন্যান্য সম্ভাব্য চাকরির মধ্যে রয়েছে এথিসিস্ট বা নীতিবিদ, সিকিউরিটি ইঞ্জিনিয়ার বা নিরাপত্তা প্রকৌশলী এবং ডেভেলপার্স যারা মানুষ এবং যন্ত্রের মধ্যে সংযোগ স্থাপনের জন্য ইউজার ফ্রেন্ডলি ইন্টারফেস তৈরি করে।\n" +
                "\n" +
                "সাধারণভাবে যখন কৃত্রিম বুদ্ধিমত্তার প্রসঙ্গ আসে, তখন বিভিন্ন পেশার মানুষদের পরামর্শ দেওয়া হয় যে তারা যেন এই প্রযুক্তিকে তাদের প্রতিযোগী হিসেবে নয়, বরং একটি অংশীদার হিসেবে দেখে।\n" +
                "\n" +
                "এবং নতুন এই প্রযুক্তির সাথে কীভাবে তাল মিলিয়ে চলা যায় সে বিষয়ে জানার চেষ্টা করে।\n" +
                "\n" +
                "সম্ভাবনার আরেকটি ক্ষেত্র হল অ্যানালাইসিস অব বিগ ডেটা অর্থাৎ বড় বড় তথ্য উপাত্তের বিশ্লেষণ।\n" +
                "\n" +
                "নেটফ্লিক্সের মতো অনলাইন প্ল্যাটফর্ম থেকে শুরু করে হ্যাড্রন কোলাইডার বা কন্ট্রোল সিস্টেমের মতো বিভিন্ন ধরনের বিশাল বিশাল তথ্য বিশ্লেষণের দক্ষতা অর্জন বেশ জরুরি।\n" +
                "\n" +
                "সাইবার নিরাপত্তা বিশেষজ্ঞদের জন্য অবশ্যই কাজের কোনও অভাব হবে না, কারণ প্রতিনিয়ত সংবেদনশীল তথ্যের হার বাড়তেই থাকবে। সে জন্য নিরাপত্তার প্রয়োজনও বাড়বে।\n" +
                "\n" +
                "এ কারণে আর্থিক প্রযুক্তি বিশেষজ্ঞ, বিজনেস অ্যানালিস্ট বা ব্যবসা বিশ্লেষক এবং ব্লকচেইন সিস্টেম ডেভেলপারদেরও প্রয়োজন হবে।\n\n" +
                "সবুজ রূপান্তরের কারণে ২০৩০ সালের মধ্যে বিশ্বব্যাপী তিন কোটি কর্মসংস্থান তৈরি হতে পারে।\n" +
                "২. 'সবুজ' চাকরি\n" +
                "ওয়ার্ল্ড ইকোনমিক ফোরামের ফিউচার অফ জবস রিপোর্ট ২০২৩ অনুসারে, সব ধরনের খাত এবং শিল্পে 'সবুজ' চাকরির চাহিদা দ্রুত বাড়ছে।\n" +
                "\n" +
                "প্রতিবেদনে বলা হয়েছে, \"সবুজ রূপান্তরের কারণে ২০৩০ সালের মধ্যে বিশ্বব্যাপী তিন কোটি কর্মসংস্থান তৈরি হতে পারে। এবং এই কর্মসংস্থান তৈরি হবে নবায়নযোগ্য জ্বালানি, অল্প শক্তি ব্যবহার করে বেশি উৎপাদন এবং কম নির্গমন প্রযুক্তি এই তিনটি খাতে।”\n" +
                "\n" +
                "সবুজ শক্তি এবং টেঁকসই উন্নয়নে নতুন চাকরির সুযোগের ক্ষেত্রে আপাতত যে সব দেশ সবচেয়ে বেশি এগিয়ে রয়েছে তাদের মধ্যে রয়েছে পশ্চিমা দেশ এবং জাপান। অবশ্য চীনও ক্রমশ এগিয়ে যাচ্ছে।\n" +
                "\n" +
                "এই কাজগুলো ব্যবসা, বিজ্ঞান, রাজনীতি বা সরাসরি পরিবেশের সাথে সম্পর্কিত হতে পারে।\n" +
                "\n" +
                "তারা মূলত ওই পেশায় থেকেই পুনরায় নবায়নযোগ্য শক্তির ব্যবহার বা শক্তির নতুন উৎসের সন্ধান এবং ব্যাটারির উন্নয়নে কাজ করতে পারে, বিপন্ন জীববৈচিত্র্য সংরক্ষণ করতে পারে, ব্যবসায়িক পরামর্শ দিতে পারে।\n" +
                "\n" +
                "উদাহরণস্বরূপ, তারা আইনি সহায়তা দিতে পারে, আইনের সাথে সংশ্লিষ্ট হতে পারে এবং পরিবেশ সুরক্ষা আইনে পরিবর্তন আনতে পারে।\n" +
                "\n" +
                "এছাড়াও সামনের দিনগুলোয় স্মার্ট হোম প্ল্যানার, আর্কিটেক্ট (স্থাপত্য কৌশলী), ডিজাইনার এবং নির্মাতাদের প্রয়োজন হবে।\n\n" +
                "চিকিৎসক এবং স্বাস্থ্যসেবা বিশেষজ্ঞদের ক্রমাগত শিখতে হবে।\n" +
                "৩. স্বাস্থ্য পেশাজীবী\n" +
                "বিশ্বে মানুষের গড় আয়ু যত বাড়ছে ততই বাড়ছে বার্ধক্যে উপনীত জনসংখ্যার হার।\n" +
                "\n" +
                "এই বয়স্ক মানুষদের যত্ন এবং চিকিত্সার প্রয়োজন ক্রমেই বাড়বে।\n" +
                "\n" +
                "অতএব, অদূর ভবিষ্যতে স্বাস্থ্যসেবা পেশাদারদের কাজের চাহিদা অনেক বেশি থাকবে।\n" +
                "\n" +
                "বিশেষ করে সেই সব স্বাস্থ্যসেবা পেশাদার প্রয়োজনীয়তা বেশি বাড়বে যারা রোগীদের শুধু ওষুধই নয় বরং নৈতিক সমর্থন দেওয়ারও দক্ষতা রাখেন।\n" +
                "\n" +
                "চিকিৎসক এবং স্বাস্থ্যসেবা বিশেষজ্ঞদের ক্রমাগত শিখতে হবে।\n" +
                "\n" +
                "তাদের ডায়াগনোসিস বা স্বাস্থ্য পরীক্ষার নতুন নতুন পদ্ধতি এবং চিকিত্সায় নতুন উদ্ভাবিত পদ্ধতির সাথে খাপ খাইয়ে নিতে হবে। কৃত্রিম বুদ্ধিমত্তাও এক্ষেত্রে সাহায্য করতে পারে।\n" +
                "\n" +
                "এছাড়াও মানসিক রোগ বিশেষজ্ঞ বা সাইকোথেরাপিস্ট এবং পার্সোনাল ডেভেলপমেন্ট মেন্টরস বা বিভিন্ন ব্যক্তিগত উন্নয়ন পরামর্শদাতা বা আধ্যাত্মিক অনুশীলনের প্রশিক্ষকদের জন্যও কাজের ক্ষেত্রে তৈরি হবে।\n\n" +
                "কৃষিতে নতুন পেশার চাহিদাও বাড়বে বলে আশা করা হচ্ছে।\n" +
                "৪. 'ম্যানুয়াল' কাজ\n" +
                "আগামী বছরগুলোয়, মেকানিক, মেরামতকারী, ইলেকট্রিশিয়ান বা বিল্ডারদের মতো ম্যানুয়াল চাকরিতে পেশাদারদের প্রয়োজন বাড়বে।\n" +
                "\n" +
                "কিছু ছোট ছোট সুনির্দিষ্ট কাজ রয়েছে যা বিভিন্ন পরিস্থিতিতে বেশ প্রয়োজন। এক্ষেত্রে মানুষের কোনও বিকল্প নেই।\n" +
                "\n" +
                "কিন্তু সব সময় সবার চেয়ে এগিয়ে থাকতে এবং সবার চাহিদার মধ্যে থাকার জন্য, এই বিশেষজ্ঞদের ক্রমাগত তাদের প্রযুক্তিগত জ্ঞান উন্নত করতে হবে এবং নতুন স্মার্ট টুলগুলো ব্যবহারে দক্ষতা অর্জন করতে হবে।\n" +
                "\n" +
                "কৃষিতে নতুন পেশার চাহিদাও বাড়বে বলে আশা করা হচ্ছে। বিশ্বের জনসংখ্যা বাড়ছে এবং প্রত্যেকের বেঁচে থাকার জন্য খাবারের প্রয়োজন।\n" +
                "\n" +
                "তারপরও যদি তুলনা করা হয় কৃষক ও প্রকৌশলীর মধ্যে তাহলে এটা বলতেই হবে যে কৃষকদের চেয়ে দক্ষ প্রকৌশলীর চাহিদাই বেশি হবে।\n\n" +
                "গল্পকারদের প্রয়োজন ভবিষ্যতে বাড়তে থাকবে\n" +
                "৫. গল্প বলা\n" +
                "আরেকটি পেশা, যার কথা খুব কমই উল্লেখ করা হয়েছে, কিন্তু নিঃসন্দেহে এই পেশাদারদের প্রয়োজন ভবিষ্যতে বাড়তে থাকবে, তা হল গল্পকার।\n" +
                "\n" +
                "হাজার হাজার বছর আগে যেমন এই গল্পকারদের প্রয়োজন ছিল, তেমনি মানুষের অভিজ্ঞতার সাথে সম্পর্কিত যে কোনও সৃজনশীল কাজ অপরিহার্য হয়ে থাকবে।\n" +
                "\n" +
                "আমাদের লেখক, কবি, পরিচালক, অভিনেতা, কৌতুক অভিনেতা, শিল্পী এবং সঙ্গীতজ্ঞদের প্রয়োজনীয়তা অব্যাহত থাকবে।\n" +
                "\n" +
                "এমনকি কৃত্রিম বুদ্ধিমত্তা এই খাতে নতুন চ্যালেঞ্জ তৈরি করলেও এই পেশাদারদের প্রয়োজনীয়তা কমবে না।\n\n" +
                "যে সব চাকরির অস্তিত্ব সংকটে\n" +
                "এমন অনেক কাজ রয়েছে যা শিগগিরই শ্রমবাজার থেকে অদৃশ্য হতে শুরু করবে। এগুলো মূলত এসব সব কাজ যা এখন স্বয়ংক্রিয়ভাবে অর্থাৎ প্রযুক্তির সাহায্যে সহজেই করা যাবে।\n" +
                "\n" +
                "নিচে এমন সম্ভাব্য সব কাজের একটি তালিকা করা রয়েছে যারা শিগগিরই শ্রম বাজার থেকে অদৃশ্য হয়ে যেতে পারে:\n" +
                "\n" +
                "গ্রাহক পরিষেবা (ক্যাশিয়ার, বিক্রয়কর্মী, পরামর্শদাতা, ইত্যাদি)।\n" +
                "অফিস ব্যবস্থাপনা (দূরবর্তী কাজ বাড়ার কারণে)।\n" +
                "ডেটা এন্ট্রি (পরিসংখ্যানবিদ, আর্থিক পেশাদার, টাইপিস্ট, প্রযুক্তিগত অনুবাদক)।\n" +
                "অ্যাকাউন্টিং।\n" +
                "কারখানার শ্রমিক যারা পুনরাবৃত্তিমূলক কাজ করেন।");
        arrayList.add(hashMap);



        hashMap = new HashMap<>();
        hashMap.put("category", "EDUCATION");
        hashMap.put("title", "পাস নম্বর পেয়েই কোটায় মেডিকেলে চান্স, ৭০ পেয়েও বঞ্চিত সাধারণরা");
        hashMap.put("imageURL", "https://www.kalbela.com/assets/news_photos/2025/01/19/image_156884_1737311206.webp");
        hashMap.put("description", "২০২৪-২৫ শিক্ষাবর্ষে এমবিবিএস ভর্তি পরীক্ষায় পাস নম্বর পেয়েই কোটাধারীরা সরকারি মেডিকেল কলেজে ভর্তির সুযোগ পাচ্ছেন। অন্যদিকে ১০০ নম্বরের মধ্যে ৭০ নম্বর পেয়েও সরকারি মেডিকেল কলেজে ভর্তির সুযোগ বঞ্চিত বহু শিক্ষার্থী। ভর্তি পরীক্ষার প্রকাশিত ফলাফল বিশ্লেষণে এমন তথ্য উঠে এসেছে।\n" +
                "\n" +
                "স্বাস্থ্য শিক্ষা অধিদপ্তর সূত্র জানায়, এবার দেশের ৫৭টি সরকারি মেডিকেল কলেজে ৫ হাজার ৩৮০টি আসনে শিক্ষার্থী ভর্তি করা হবে। এর মধ্যে মুক্তিযোদ্ধার পুত্র-কন্যা ও নাতি-নাতনিদের জন্য ২৬৯টি এবং পশ্চাৎপদ জনগোষ্ঠীর জন্য ৩৯টি আসন সংরক্ষিত।\n" +
                "\n" +
                "ফলাফলের তথ্য বলছে, মুক্তিযোদ্ধা কোটায় আবেদনকারীদের মধ্যে পাস করেছেন ১৯৩ জন। ফলে তারা সবাই ভর্তির সুযোগ পাচ্ছেন।\n" +
                "\n" +
                "ভর্তি পরীক্ষায় পাস নম্বর ৪০। প্রতিযোগিতা না থাকায় পাস নম্বর পেয়েই মুক্তিযোদ্ধা এবং পশ্চাৎপদ জনগোষ্ঠীর উপজাতি শিক্ষার্থীরা সরকারি মেডিক্যালে ভর্তির জন্য নির্বাচিত হয়েছেন।" +
                "এ বিষয়ে স্বাস্থ্য শিক্ষা ও পরিবার কল্যাণ বিভাগের সচিব ডা. মো. সারোয়ার বারী সাংবাদিকদের বলেন, ‘মুক্তিযোদ্ধা কোটায় কতজন ভর্তির সুযোগ পেয়েছেন, তাদের প্রাপ্ত নম্বর কত—সেগুলো খোঁজ নিতে হবে। এরপর বিষয়টি নিয়ে কথা বলা যাবে।’\n" +
                "\n" +
                "দেশের সরকারি-বেসরকারি মেডিকেল কলেজের ২০২৪-২৫ শিক্ষাবর্ষের ভর্তি পরীক্ষায় পাসের হার ৪৫ দশমিক ৬২ শতাংশ। এবার প্রাপ্ত সর্বোচ্চ নম্বর ৯০.৭৫।\n" +
                "\n" +
                "মেডিকেল ভর্তি পরীক্ষায় অংশ নেন ১ লাখ ৩১ হাজার ৭২৯ জন পরীক্ষার্থী। এর মধ্যে ভর্তি পরীক্ষায় উত্তীর্ণ হন ৬০ হাজার ৯৫ জন।\n" +
                "\n" +
                "সারা দেশের ৩৭টি সরকারি মেডিকেল কলেজে ভর্তির জন্য ৫ হাজার ৩৭২ জন পরীক্ষার্থীকে প্রাথমিকভাবে নির্বাচিত করা হয়েছে।\n" +
                "\n" +
                "রোববার (১৯ জানুয়ারি ) বিকেল ৪টার পর এই ফল প্রকাশ করে স্বাস্থ্য শিক্ষা অধিদপ্তর।\n" +
                "\n" +
                "এদিকে বিষয়টি নিয়ে সামাজিক যোগাযোগ মাধ্যম ফেসবুকে ক্ষোভ প্রকাশ করছেন অনেকে। এ তালিকায় রয়েছেন জাতীয় নাগরিক কমিটির মুখ্য সংগঠক সারজিস আলমও। তিনি লিখেছেন, ‘ভর্তি পরীক্ষায় এখনো কীসের কোটা? আজ থেকেই এই শোষণের শেষ হতে হবে। ফুলস্টপ।’");
        arrayList.add(hashMap);




    }

}